I am not able to reproduce the problem using the configuration from the issue description using Terraform 1.6.3 and AWS Provide 5.31.0. Applying the config will create a log group named `something` as expected. Only if I set `name` to null and `name_prefix` to `something` that it would create a log group named `something20240113075235670700000001` as an example.

```tf
C:\working\test>terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "something"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_cloudwatch_log_group.this: Creating...
aws_cloudwatch_log_group.this: Creation complete after 0s [id=something]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```